{
  "SPY": {
    "bid": 422.93,
    "ask": 423.14,
    "bidSize": 101,
    "askSize": 75,
    "volume": 764700,
    "quoteDetails": "SPDR S&P 500 ETF Trust (SPY) tracks the S&P 500 index, providing exposure to 500 large-cap U.S. stocks across multiple sectors."
  },
  "DJI": {
    "bid": 33929,
    "ask": 33933,
    "bidSize": 49,
    "askSize": 42,
    "volume": 160200000,
    "quoteDetails": "The Dow Jones Industrial Average (DJI) is a price-weighted average of 30 significant stocks traded on the New York Stock Exchange (NYSE) and the NASDAQ."
  },
  "RUS": {
    "bid": 2305.79,
    "ask": 2305.93,
    "bidSize": 101,
    "askSize": 75,
    "volume": 1270700,
    "quoteDetails": "The Russell 2000 Index (RUS) measures the performance of 2,000 small-cap U.S. companies based on market capitalization."
  },
  "NDX": {
    "bid": 14106.88,
    "ask": 14107,
    "bidSize": 26,
    "askSize": 31,
    "volume": 217619900,
    "quoteDetails": "The NASDAQ-100 Index (NDX) tracks the performance of 100 non-financial companies listed on the NASDAQ stock exchange."
  },
  "TSLA": {
    "bid": 719.32,
    "ask": 719.63,
    "bidSize": 47,
    "askSize": 31,
    "volume": 2720400,
    "quoteDetails": "Tesla Inc. (TSLA) is an American electric vehicle and clean energy company, known for producing electric cars, battery energy storage, and solar products."
  },
  "AAPL": {
    "bid": 132.88,
    "ask": 132.9,
    "bidSize": 50,
    "askSize": 55,
    "volume": 8000000,
    "quoteDetails": "Apple Inc. (AAPL) designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories, as well as offers services such as the App Store, iCloud, Apple Music, and Apple TV+."
    },
    "GOOGL": {
    "bid": 2412.34,
    "ask": 2414.89,
    "bidSize": 20,
    "askSize": 35,
    "volume": 1200000,
    "quoteDetails": "Alphabet Inc. (GOOGL) is a multinational conglomerate that provides online search, advertising, and streaming services through its Google brand, as well as offers hardware products such as the Pixel smartphone and Google Home smart speaker."
    },
    "AMZN": {
    "bid": 3280.01,
    "ask": 3282.56,
    "bidSize": 30,
    "askSize": 25,
    "volume": 500000,
    "quoteDetails": "Amazon.com Inc. (AMZN) is an American multinational technology company that focuses on e-commerce, cloud computing, digital streaming, and artificial intelligence."
    }
  }